In [ ]:
import numpy as np
import pandas as pd

data = pd.read_csv('/content/titanic.csv')
data
# find NAN isna() is same as isnull but does not provides the nulled values
nan_df = data[data.isnull().any(axis=1)]
display(nan_df.head)

data= data.dropna(how="all")
data.head()

data['Age'] = pd.to_numeric(data['Age'])
data['Fare'] = pd.to_numeric(data['Fare'])
data

#1.	Who paid highest fare
max_fare = data['Fare'].max()
i = data['Fare'].argmax()
print(data.loc[i].at["Name"], "paid the highest fare" ,max_fare)

#2.	Who paid lowest fare
min_fare = data['Fare'].min()
x = data['Fare'].argmin()
print(data.loc[x].at["Name"], "paid the lowest fare" ,min_fare)

#3. Find oldest passenger in the data
max_age = data['Age'].max()
i = data['Age'].argmax()
print(data.loc[i].at["Name"], "is the oldest passenger" ,max_age)

#4. Find youngest passenger in the data
min_age = data['Age'].min()
x = data['Age'].argmin()
print(data.loc[x].at["Name"], "is the youngest passenger" ,min_age)

survive=0
dead=0
for i in data["Survived"]:
   if data.loc[i].at["Survived"]== 1:
      survive = survive +1
   elif data.loc[i].at["Survived"] == 0:
      dead = dead +1
#5.the total number of passenger who survived
print("Total number of passenger who survived=", survive)

#6.the total number of passenger who are no more live
print("Total number of passenger who dead=", dead)

#7.Calculate the mean of age.
Fare_max=data.groupby(['Name']).mean()
print(Fare_max['Age'])
mean = data['Age'].mean()
print("Mean of age is", mean)

#8.	Which class contain maximum number of passengers and how many?
class1=0
class2=0
class3=0
for i in data["Pclass"]:
   if data.loc[i].at["Pclass"]== 1:
      class1 = class1 +1
   elif data.loc[i].at["Pclass"] == 2:
      class2 = class2 +1
   elif data.loc[i].at["Pclass"] == 3 :
      class3 = class3 + 1
if (class1>class2 and class1>class3):
  print("Pclass 1 has maximum number of passengers", class1)
elif (class2>class1 and class2>class3):
  print("Pclass 2 has maximum number of passengers", class2)
elif (class3>class1 and class3>class2):
  print("Pclass 3 has maximum number of passengers", class3)

#9. Display Passenger Id who survived
id=data.groupby(['Name']).sum()
print(Fare_max['PassengerId'])


#10. Calculate Median of 'Fare' column
median = data['Fare'].median()
print("Median of fare is",median)

<bound method NDFrame.head of      PassengerId  Survived  Pclass                                      Name  \
5              6         0       3                          Moran, Mr. James
17            18         1       2              Williams, Mr. Charles Eugene
19            20         1       3                   Masselmani, Mrs. Fatima
26            27         0       3                   Emir, Mr. Farred Chehab
28            29         1       3             O'Dwyer, Miss. Ellen "Nellie"
..           ...       ...     ...                                       ...
859          860         0       3                          Razi, Mr. Raihed
863          864         0       3         Sage, Miss. Dorothy Edith "Dolly"
868          869         0       3               van Melkebeke, Mr. Philemon
878          879         0       3                        Laleff, Mr. Kristo
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"

        Sex  Age     Fare Embarked
5      male  NaN   8.4583        Q
17     male  NaN  13.0000        S
19   female  NaN   7.2250        C
26     male  NaN   7.2250        C
28   female  NaN   7.8792        Q
..      ...  ...      ...      ...
859    male  NaN   7.2292        C
863  female  NaN  69.5500        S
868    male  NaN   9.5000        S
878    male  NaN   7.8958        S
888  female  NaN  23.4500        S

[179 rows x 8 columns]>

Ward, Miss. Anna paid the highest fare 512.3292
Leonard, Mr. Lionel paid the lowest fare 0.0
Barkworth, Mr. Algernon Henry Wilson is the oldest passenger 80.0
Thomas, Master. Assad Alexander is the youngest passenger 0.42
Total number of passenger who survived= 342
Total number of passenger who dead= 549
Name
Abbing, Mr. Anthony                      42.0
Abbott, Mr. Rossmore Edward              16.0
Abbott, Mrs. Stanton (Rosa Hunt)         35.0
Abelson, Mr. Samuel                      30.0
Abelson, Mrs. Samuel (Hannah Wizosky)    28.0
                                         ...
de Mulder, Mr. Theodore                  30.0
de Pelsmaeker, Mr. Alfons                16.0
del Carlo, Mr. Sebastiano                29.0
van Billiard, Mr. Austin Blyler          40.5
van Melkebeke, Mr. Philemon               NaN
Name: Age, Length: 891, dtype: float64
Mean of age is 29.69911764705882
Pclass 1 has maximum number of passengers 707
Name
Abbing, Mr. Anthony                      846.0
Abbott, Mr. Rossmore Edward              747.0
Abbott, Mrs. Stanton (Rosa Hunt)         280.0
Abelson, Mr. Samuel                      309.0
Abelson, Mrs. Samuel (Hannah Wizosky)    875.0
                                         ...
de Mulder, Mr. Theodore                  287.0
de Pelsmaeker, Mr. Alfons                283.0
del Carlo, Mr. Sebastiano                362.0
van Billiard, Mr. Austin Blyler          154.0
van Melkebeke, Mr. Philemon              869.0
Name: PassengerId, Length: 891, dtype: float64
Median of fare is 14.4542

<ipython-input-7-7ed8eaf8249a>:51: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  Fare_max=data.groupby(['Name']).mean()
<ipython-input-7-7ed8eaf8249a>:75: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  id=data.groupby(['Name']).sum()

In [ ]:
data['Age'] = pd.to_numeric(data['Age'])
data['Fare'] = pd.to_numeric(data['Fare'])
data

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,S
...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,13.0000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,23.4500,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,30.0000,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,7.7500,Q

In [ ]:
#1.	Who paid highest fare
maxValue = data['Fare'].max()
i = data['Fare'].argmax()
print("Highest fare paid is", maxValue ,"by" , data.loc[i].at["Name"])

Highest fare paid is 512.3292 by Ward, Miss. Anna

In [ ]:
#2.	Who paid lowest fare
min_fare = data['Fare'].min()
x = data['Fare'].argmax()
print(data.loc[x].at["Name"], "paid the lowest fare" ,min_fare)

Ward, Miss. Anna paid the lowest fare 0.0

In [ ]:
#3. Find oldest passenger in the data
max_age = data['Age'].max()
i = data['Age'].argmax()
print(data.loc[i].at["Name"], "is the oldest passenger" ,max_age)

Barkworth, Mr. Algernon Henry Wilson is the oldest passenger 80.0

In [ ]:
#4. Find youngest passenger in the data
min_age = data['Age'].min()
x = data['Age'].argmax()
print(data.loc[i].at["Name"], "is the youngest passenger" ,min_age)

Barkworth, Mr. Algernon Henry Wilson is the youngest passenger 0.42

In [ ]:
survive=0
dead=0
for i in data["Survived"]:
   if data.loc[i].at["Survived"]== 1:
      survive = survive +1
   elif data.loc[i].at["Survived"] == 0:
      dead = dead +1
#5.the total number of passenger who survived
print("Total number of passenger who survived=", survive)

#6.the total number of passenger who are no more live

print("Total number of passenger who dead=", dead)

Total number of passenger who survived= 342
Total number of passenger who dead= 549

In [ ]:
#7.Calculate the mean of age.
Fare_max=data.groupby(['Name']).mean()
print(Fare_max['Age'])
mean = data['Age'].mean()
print("Mean of age is", mean)

Name
Abbing, Mr. Anthony                      42.0
Abbott, Mr. Rossmore Edward              16.0
Abbott, Mrs. Stanton (Rosa Hunt)         35.0
Abelson, Mr. Samuel                      30.0
Abelson, Mrs. Samuel (Hannah Wizosky)    28.0
                                         ...
de Mulder, Mr. Theodore                  30.0
de Pelsmaeker, Mr. Alfons                16.0
del Carlo, Mr. Sebastiano                29.0
van Billiard, Mr. Austin Blyler          40.5
van Melkebeke, Mr. Philemon               NaN
Name: Age, Length: 891, dtype: float64
Mean of age is 29.69911764705882

<ipython-input-80-46dbced4e84a>:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  Fare_max=data.groupby(['Name']).mean()

In [ ]:
#8.	Which class contain maximum number of passengers and how many?
class1=0
class2=0
class3=0
for i in data["Pclass"]:
   if data.loc[i].at["Pclass"]== 1:
      class1 = class1 +1
   elif data.loc[i].at["Pclass"] == 2:
      class2 = class2 +1
   elif data.loc[i].at["Pclass"] == 3 :
      class3 = class3 + 1
if (class1>class2 and class1>class3):
  print("Pclass 1 has maximum number of passengers", class1)
elif (class2>class1 and class2>class3):
  print("Pclass 2 has maximum number of passengers", class2)
elif (class3>class1 and class3>class2):
  print("Pclass 3 has maximum number of passengers", class3)

Pclass 1 has maximum number of passengers 707

In [ ]:
#9. Display Passenger Id who survived
id=data.groupby(['Name']).sum()
print(Fare_max['PassengerId'])

Name
Abbing, Mr. Anthony                      846.0
Abbott, Mr. Rossmore Edward              747.0
Abbott, Mrs. Stanton (Rosa Hunt)         280.0
Abelson, Mr. Samuel                      309.0
Abelson, Mrs. Samuel (Hannah Wizosky)    875.0
                                         ...
de Mulder, Mr. Theodore                  287.0
de Pelsmaeker, Mr. Alfons                283.0
del Carlo, Mr. Sebastiano                362.0
van Billiard, Mr. Austin Blyler          154.0
van Melkebeke, Mr. Philemon              869.0
Name: PassengerId, Length: 891, dtype: float64

<ipython-input-81-056dc11a8397>:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  id=data.groupby(['Name']).sum()

In [ ]:
#10. Calculate Median of 'Fare' column
median = data['Fare'].median()
print("Median of fare is",median)

Median of fare is 14.4542

In [ ]:
import numpy as np
import pandas as pd

data = pd.read_csv('/content/titanic.csv')
data
# find NAN isna() is same as isnull but does not provides the nulled values
nan_df = data[data.isnull().any(axis=1)]
display(nan_df.head)

data= data.dropna(how="all")
data.head()

<bound method NDFrame.head of      PassengerId  Survived  Pclass                                      Name  \
5              6         0       3                          Moran, Mr. James
17            18         1       2              Williams, Mr. Charles Eugene
19            20         1       3                   Masselmani, Mrs. Fatima
26            27         0       3                   Emir, Mr. Farred Chehab
28            29         1       3             O'Dwyer, Miss. Ellen "Nellie"
..           ...       ...     ...                                       ...
859          860         0       3                          Razi, Mr. Raihed
863          864         0       3         Sage, Miss. Dorothy Edith "Dolly"
868          869         0       3               van Melkebeke, Mr. Philemon
878          879         0       3                        Laleff, Mr. Kristo
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"

     Gender  Age     Fare Embarked
5      male  NaN   8.4583        Q
17     male  NaN  13.0000        S
19   female  NaN   7.2250        C
26     male  NaN   7.2250        C
28   female  NaN   7.8792        Q
..      ...  ...      ...      ...
859    male  NaN   7.2292        C
863  female  NaN  69.5500        S
868    male  NaN   9.5000        S
878    male  NaN   7.8958        S
888  female  NaN  23.4500        S

[179 rows x 8 columns]>

,PassengerId,Survived,Pclass,Name,Gender,Age,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,S